Revit 2025 API
RebarBendData.BendRadius Property
 The radius of all fillets, except hook fillets, in the Rebar shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double BendRadius { get; set; }
Public Property BendRadius As Double
	Get
	Set
public:
property double BendRadius {
	double get ();
	void set (double value);
}
member BendRadius : float with get, set
Property Value
Double
Remarks
 Inner radius, not centerline
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace